TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES0 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES0_CPU1_CLA1        0x1U         // CPU1_CLA1 software reset bit
#define SYSCTL_SOFTPRES0_CPU1_CPUBGCRC    0x2000U      // CPU1 CPUBGCRC Module reset bit
#define SYSCTL_SOFTPRES0_CPU1_CLA1BGCRC   0x4000U      // CPU1 CLA1BGCRC Module reset bit
#define SYSCTL_SOFTPRES0_CPU2_CPUBGCRC    0x10000U     // CPU2 CPUBGCRC Module reset bit
#define SYSCTL_SOFTPRES0_CPU1_ERAD        0x1000000U   // ERAD Module reset bit
#define SYSCTL_SOFTPRES0_CPU2_ERAD        0x2000000U   // ERAD Module reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES1 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES1_EMIF1   0x1U   // EMIF1 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES2 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES2_EPWM1    0x1U       // EPWM1 software reset bit
#define SYSCTL_SOFTPRES2_EPWM2    0x2U       // EPWM2 software reset bit
#define SYSCTL_SOFTPRES2_EPWM3    0x4U       // EPWM3 software reset bit
#define SYSCTL_SOFTPRES2_EPWM4    0x8U       // EPWM4 software reset bit
#define SYSCTL_SOFTPRES2_EPWM5    0x10U      // EPWM5 software reset bit
#define SYSCTL_SOFTPRES2_EPWM6    0x20U      // EPWM6 software reset bit
#define SYSCTL_SOFTPRES2_EPWM7    0x40U      // EPWM7 software reset bit
#define SYSCTL_SOFTPRES2_EPWM8    0x80U      // EPWM8 software reset bit
#define SYSCTL_SOFTPRES2_EPWM9    0x100U     // EPWM9 software reset bit
#define SYSCTL_SOFTPRES2_EPWM10   0x200U     // EPWM10 software reset bit
#define SYSCTL_SOFTPRES2_EPWM11   0x400U     // EPWM11 software reset bit
#define SYSCTL_SOFTPRES2_EPWM12   0x800U     // EPWM12 software reset bit
#define SYSCTL_SOFTPRES2_EPWM13   0x1000U    // EPWM13 software reset bit
#define SYSCTL_SOFTPRES2_EPWM14   0x2000U    // EPWM14 software reset bit
#define SYSCTL_SOFTPRES2_EPWM15   0x4000U    // EPWM15 software reset bit
#define SYSCTL_SOFTPRES2_EPWM16   0x8000U    // EPWM16 software reset bit
#define SYSCTL_SOFTPRES2_EPWM17   0x10000U   // EPWM17 software reset bit
#define SYSCTL_SOFTPRES2_EPWM18   0x20000U   // EPWM18 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES3 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES3_ECAP1   0x1U    // ECAP1 software reset bit
#define SYSCTL_SOFTPRES3_ECAP2   0x2U    // ECAP2 software reset bit
#define SYSCTL_SOFTPRES3_ECAP3   0x4U    // ECAP3 software reset bit
#define SYSCTL_SOFTPRES3_ECAP4   0x8U    // ECAP4 software reset bit
#define SYSCTL_SOFTPRES3_ECAP5   0x10U   // ECAP5 software reset bit
#define SYSCTL_SOFTPRES3_ECAP6   0x20U   // ECAP6 software reset bit
#define SYSCTL_SOFTPRES3_ECAP7   0x40U   // ECAP7 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES4 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES4_EQEP1   0x1U    // EQEP1 software reset bit
#define SYSCTL_SOFTPRES4_EQEP2   0x2U    // EQEP2 software reset bit
#define SYSCTL_SOFTPRES4_EQEP3   0x4U    // EQEP3 software reset bit
#define SYSCTL_SOFTPRES4_EQEP4   0x8U    // EQEP4 software reset bit
#define SYSCTL_SOFTPRES4_EQEP5   0x10U   // EQEP5 software reset bit
#define SYSCTL_SOFTPRES4_EQEP6   0x20U   // EQEP6 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES6 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES6_SD1   0x1U   // SD1 software reset bit
#define SYSCTL_SOFTPRES6_SD2   0x2U   // SD2 software reset bit
#define SYSCTL_SOFTPRES6_SD3   0x4U   // SD3 software reset bit
#define SYSCTL_SOFTPRES6_SD4   0x8U   // SD4 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES7 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES7_SCI_A    0x1U       // SCI_A software reset bit
#define SYSCTL_SOFTPRES7_SCI_B    0x2U       // SCI_B software reset bit
#define SYSCTL_SOFTPRES7_UART_A   0x10000U   // UART_A software reset bit
#define SYSCTL_SOFTPRES7_UART_B   0x20000U   // UART_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES8 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES8_SPI_A   0x1U   // SPI_A software reset bit
#define SYSCTL_SOFTPRES8_SPI_B   0x2U   // SPI_B software reset bit
#define SYSCTL_SOFTPRES8_SPI_C   0x4U   // SPI_C software reset bit
#define SYSCTL_SOFTPRES8_SPI_D   0x8U   // SPI_D software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES9 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES9_I2C_A     0x1U       // I2C_A software reset bit
#define SYSCTL_SOFTPRES9_I2C_B     0x2U       // I2C_B software reset bit
#define SYSCTL_SOFTPRES9_PMBUS_A   0x10000U   // PMBUS_A software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES10 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES10_CAN_A    0x1U    // CAN_A software reset bit
#define SYSCTL_SOFTPRES10_MCAN_A   0x10U   // MCAN_A  software reset bit
#define SYSCTL_SOFTPRES10_MCAN_B   0x20U   // MCAN_B  software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES11 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES11_USB_A   0x10000U   // USB_A software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES13 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES13_ADC_A   0x1U   // ADC_A software reset bit
#define SYSCTL_SOFTPRES13_ADC_B   0x2U   // ADC_B software reset bit
#define SYSCTL_SOFTPRES13_ADC_C   0x4U   // ADC_C software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES14 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES14_CMPSS1    0x1U     // CMPSS1 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS2    0x2U     // CMPSS2 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS3    0x4U     // CMPSS3 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS4    0x8U     // CMPSS4 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS5    0x10U    // CMPSS5 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS6    0x20U    // CMPSS6 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS7    0x40U    // CMPSS7 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS8    0x80U    // CMPSS8 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS9    0x100U   // CMPSS9 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS10   0x200U   // CMPSS10 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS11   0x400U   // CMPSS11 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES16 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES16_DAC_A   0x10000U   // Buffered_DAC_A software reset bit
#define SYSCTL_SOFTPRES16_DAC_C   0x40000U   // Buffered_DAC_C software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES17 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES17_CLB1   0x1U    // CLB1 software reset bit
#define SYSCTL_SOFTPRES17_CLB2   0x2U    // CLB2 software reset bit
#define SYSCTL_SOFTPRES17_CLB3   0x4U    // CLB3 software reset bit
#define SYSCTL_SOFTPRES17_CLB4   0x8U    // CLB4 software reset bit
#define SYSCTL_SOFTPRES17_CLB5   0x10U   // CLB5 software reset bit
#define SYSCTL_SOFTPRES17_CLB6   0x20U   // CLB6 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES18 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES18_FSITX_A   0x1U       // FSITX_A software reset bit
#define SYSCTL_SOFTPRES18_FSITX_B   0x2U       // FSITX_B software reset bit
#define SYSCTL_SOFTPRES18_FSIRX_A   0x10000U   // FSIRX_A software reset bit
#define SYSCTL_SOFTPRES18_FSIRX_B   0x20000U   // FSIRX_B software reset bit
#define SYSCTL_SOFTPRES18_FSIRX_C   0x40000U   // FSIRX_C software reset bit
#define SYSCTL_SOFTPRES18_FSIRX_D   0x80000U   // FSIRX_D software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES19 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES19_LIN_A   0x1U   // LIN_A software reset bit
#define SYSCTL_SOFTPRES19_LIN_B   0x2U   // LIN_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES21 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES21_DCC0   0x1U   // DCC Module reset bit
#define SYSCTL_SOFTPRES21_DCC1   0x2U   // DCC Module reset bit
#define SYSCTL_SOFTPRES21_DCC2   0x4U   // DCC Module reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES23 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES23_ETHERCAT   0x1U   // ETHERCAT Module reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES26 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES26_AESA   0x1U   // AES Module Reset Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES27 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES27_EPG1   0x1U   // EPG Module Reset Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES28 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES28_FLASHA   0x1U   // Flash Wrapper Module Reset Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES29 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES29_ADCCHECKER1     0x1U       // ADCCHECKER1 software reset bit
#define SYSCTL_SOFTPRES29_ADCCHECKER2     0x2U       // ADCCHECKER2 software reset bit
#define SYSCTL_SOFTPRES29_ADCCHECKER3     0x4U       // ADCCHECKER3 software reset bit
#define SYSCTL_SOFTPRES29_ADCCHECKER4     0x8U       // ADCCHECKER4 software reset bit
#define SYSCTL_SOFTPRES29_ADCCHECKER5     0x10U      // ADCCHECKER5 software reset bit
#define SYSCTL_SOFTPRES29_ADCCHECKER6     0x20U      // ADCCHECKER6 software reset bit
#define SYSCTL_SOFTPRES29_ADCCHECKER7     0x40U      // ADCCHECKER7 software reset bit
#define SYSCTL_SOFTPRES29_ADCCHECKER8     0x80U      // ADCCHECKER8 software reset bit
#define SYSCTL_SOFTPRES29_ADCSEAGGRCPU1   0x10000U   // ADCSEAGGRCPU1 software reset bit
#define SYSCTL_SOFTPRES29_ADCSEAGGRCPU2   0x20000U   // ADCSEAGGRCPU2 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES40 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES40_JTAG_NTRST_S       0U
#define SYSCTL_SOFTPRES40_JTAG_NTRST_M       0xFU          // Multi Bit JTAG nTRST
#define SYSCTL_SOFTPRES40_JTAG_NTRST_KEY_S   16U
#define SYSCTL_SOFTPRES40_JTAG_NTRST_KEY_M   0xFFFF0000U   // JTAG nTRST Key

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL0 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL0_EPWM1    0x1U       // EPWM1 CPU select bit
#define SYSCTL_CPUSEL0_EPWM2    0x2U       // EPWM2 CPU select bit
#define SYSCTL_CPUSEL0_EPWM3    0x4U       // EPWM3 CPU select bit
#define SYSCTL_CPUSEL0_EPWM4    0x8U       // EPWM4 CPU select bit
#define SYSCTL_CPUSEL0_EPWM5    0x10U      // EPWM5 CPU select bit
#define SYSCTL_CPUSEL0_EPWM6    0x20U      // EPWM6 CPU select bit
#define SYSCTL_CPUSEL0_EPWM7    0x40U      // EPWM7 CPU select bit
#define SYSCTL_CPUSEL0_EPWM8    0x80U      // EPWM8 CPU select bit
#define SYSCTL_CPUSEL0_EPWM9    0x100U     // EPWM9 CPU select bit
#define SYSCTL_CPUSEL0_EPWM10   0x200U     // EPWM10 CPU select bit
#define SYSCTL_CPUSEL0_EPWM11   0x400U     // EPWM11 CPU select bit
#define SYSCTL_CPUSEL0_EPWM12   0x800U     // EPWM12 CPU select bit
#define SYSCTL_CPUSEL0_EPWM13   0x1000U    // EPWM13 CPU select bit
#define SYSCTL_CPUSEL0_EPWM14   0x2000U    // EPWM14 CPU select bit
#define SYSCTL_CPUSEL0_EPWM15   0x4000U    // EPWM15 CPU select bit
#define SYSCTL_CPUSEL0_EPWM16   0x8000U    // EPWM16 CPU select bit
#define SYSCTL_CPUSEL0_EPWM17   0x10000U   // EPWM17 CPU select bit
#define SYSCTL_CPUSEL0_EPWM18   0x20000U   // EPWM18 CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL1 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL1_ECAP1   0x1U    // ECAP1 CPU select bit
#define SYSCTL_CPUSEL1_ECAP2   0x2U    // ECAP2 CPU select bit
#define SYSCTL_CPUSEL1_ECAP3   0x4U    // ECAP3 CPU select bit
#define SYSCTL_CPUSEL1_ECAP4   0x8U    // ECAP4 CPU select bit
#define SYSCTL_CPUSEL1_ECAP5   0x10U   // ECAP5 CPU select bit
#define SYSCTL_CPUSEL1_ECAP6   0x20U   // ECAP6 CPU select bit
#define SYSCTL_CPUSEL1_ECAP7   0x40U   // ECAP7 CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL2 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL2_EQEP1   0x1U    // EQEP1 CPU select bit
#define SYSCTL_CPUSEL2_EQEP2   0x2U    // EQEP2 CPU select bit
#define SYSCTL_CPUSEL2_EQEP3   0x4U    // EQEP3 CPU select bit
#define SYSCTL_CPUSEL2_EQEP4   0x8U    // EQEP4 CPU select bit
#define SYSCTL_CPUSEL2_EQEP5   0x10U   // EQEP5 CPU select bit
#define SYSCTL_CPUSEL2_EQEP6   0x20U   // EQEP6 CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL3 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL3_HRCAP6   0x20U   // HRCAP6 CPU select bit
#define SYSCTL_CPUSEL3_HRCAP7   0x40U   // HRCAP7 CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL4 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL4_SD1   0x1U   // SD1 CPU select bit
#define SYSCTL_CPUSEL4_SD2   0x2U   // SD2 CPU select bit
#define SYSCTL_CPUSEL4_SD3   0x4U   // SD3 CPU select bit
#define SYSCTL_CPUSEL4_SD4   0x8U   // SD4 CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL5 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL5_SCI_A    0x1U       // SCI_A CPU select bit
#define SYSCTL_CPUSEL5_SCI_B    0x2U       // SCI_B CPU select bit
#define SYSCTL_CPUSEL5_UART_A   0x10000U   // UART_A CPU select bit
#define SYSCTL_CPUSEL5_UART_B   0x20000U   // UART_B CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL6 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL6_SPI_A   0x1U   // SPI_A CPU select bit
#define SYSCTL_CPUSEL6_SPI_B   0x2U   // SPI_B CPU select bit
#define SYSCTL_CPUSEL6_SPI_C   0x4U   // SPI_C CPU select bit
#define SYSCTL_CPUSEL6_SPI_D   0x8U   // SPI_D CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL7 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL7_I2C_A     0x1U       // I2C_A CPU select bit
#define SYSCTL_CPUSEL7_I2C_B     0x2U       // I2C_B CPU select bit
#define SYSCTL_CPUSEL7_PMBUS_A   0x10000U   // PMBUS_A CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL8 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL8_CAN_A    0x1U    // CAN_A CPU select bit
#define SYSCTL_CPUSEL8_MCAN_A   0x10U   // MCAN_A CPU select bit
#define SYSCTL_CPUSEL8_MCAN_B   0x20U   // MCAN_B CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL9 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL9_USB_A   0x10000U   // USB_A CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL11 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL11_ADC_A   0x1U   // ADC_A CPU select bit
#define SYSCTL_CPUSEL11_ADC_B   0x2U   // ADC_B CPU select bit
#define SYSCTL_CPUSEL11_ADC_C   0x4U   // ADC_C CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL12 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL12_CMPSS1    0x1U     // CMPSS1 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS2    0x2U     // CMPSS2 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS3    0x4U     // CMPSS3 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS4    0x8U     // CMPSS4 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS5    0x10U    // CMPSS5 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS6    0x20U    // CMPSS6 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS7    0x40U    // CMPSS7 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS8    0x80U    // CMPSS8 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS9    0x100U   // CMPSS9 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS10   0x200U   // CMPSS10 CPU select bit
#define SYSCTL_CPUSEL12_CMPSS11   0x400U   // CMPSS11 CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL13 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL13_DCC0   0x1U   // DCC0 CPU select bit
#define SYSCTL_CPUSEL13_DCC1   0x2U   // DCC1 CPU select bit
#define SYSCTL_CPUSEL13_DCC2   0x4U   // DCC2 CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL14 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL14_DAC_A   0x10000U   // Buffered_DAC_A CPU select bit
#define SYSCTL_CPUSEL14_DAC_C   0x40000U   // Buffered_DAC_C CPU select bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSEL15 register
//
//*************************************************************************************************
#define SYSCTL_CPUSEL15_CLB1   0x1U    // CLB1 CPU select bit
#define SYSCTL_CPUSEL15_CLB2   0x2U    // CLB2 CPU select bit
#define SYSCTL_CPUSEL15_CLB3   0x4U    // CLB3 CPU select bit
#define SYSCTL_CPUSEL15_CLB4   0x8U    // CLB4 CPU select bit
#define SYSCTL_CPUSEL15_CLB5   0x10U   // CLB5 CPU select bit
#define SYSCTL_CPUSEL15_CLB6   0x20U   // CLB6 CPU select bit

