TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the SYNCBUSY register
//
//*************************************************************************************************
#define SYSCTL_SYNCBUSY_BUSY             0x1U          // Status bit indicating synchronization in
                                                       // progress
#define SYSCTL_SYNCBUSY_AUXCLKDIVSEL     0x10000U      // BUSY status bit for AUXCLKDIVSEL
#define SYSCTL_SYNCBUSY_AUXPLLMULT       0x20000U      // BUSY status bit for AUXPLLMULT
#define SYSCTL_SYNCBUSY_CLBCLKCTL        0x40000U      // BUSY status bit for CLBCLKCTL
#define SYSCTL_SYNCBUSY_ETHERCATCLKCTL   0x80000U      // BUSY status bit for ETHERCATCLKCTL
#define SYSCTL_SYNCBUSY_PERCLKDIVSEL     0x100000U     // BUSY status bit for PERCLKDIVSEL
#define SYSCTL_SYNCBUSY_SYSCLKDIVSEL     0x200000U     // BUSY status bit for SYSCLKDIVSEL
#define SYSCTL_SYNCBUSY_SYSPLLCTL1       0x400000U     // BUSY status bit for SYSPLLCTL1
#define SYSCTL_SYNCBUSY_SYSPLLMULT       0x800000U     // BUSY status bit for SYSPLLMULT
#define SYSCTL_SYNCBUSY_XCLKOUTDIVSEL    0x2000000U    // BUSY status bit for XCLKOUTDIVSEL
#define SYSCTL_SYNCBUSY_XTALCR           0x4000000U    // BUSY status bit for XTALCR
#define SYSCTL_SYNCBUSY_CLKSRCCTL1       0x8000000U    // BUSY status bit for CLKSRCCTL1
#define SYSCTL_SYNCBUSY_CLKSRCCTL2       0x10000000U   // BUSY status bit for CLKSRCCTL2
#define SYSCTL_SYNCBUSY_CLKSRCCTL3       0x20000000U   // BUSY status bit for CLKSRCCTL3
#define SYSCTL_SYNCBUSY_CPU1TMR2CTL      0x40000000U   // BUSY status bit for CPU1TMR2CTL
#define SYSCTL_SYNCBUSY_CPU2TMR2CTL      0x80000000U   // BUSY status bit for CPU2TMR2CTL


//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSYSLOCK1 register
//
//*************************************************************************************************
#define SYSCTL_CPUSYSLOCK1_PIEVERRADDR   0x4U          // Lock bit for PIEVERRADDR Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR0       0x8U          // Lock bit for PCLKCR0 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR1       0x10U         // Lock bit for PCLKCR1 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR2       0x20U         // Lock bit for PCLKCR2 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR3       0x40U         // Lock bit for PCLKCR3 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR4       0x80U         // Lock bit for PCLKCR4 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR6       0x200U        // Lock bit for PCLKCR6 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR7       0x400U        // Lock bit for PCLKCR7 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR8       0x800U        // Lock bit for PCLKCR8 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR9       0x1000U       // Lock bit for PCLKCR9 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR10      0x2000U       // Lock bit for PCLKCR10 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR11      0x4000U       // Lock bit for PCLKCR11 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR13      0x10000U      // Lock bit for PCLKCR13 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR14      0x20000U      // Lock bit for PCLKCR14 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR16      0x80000U      // Lock bit for PCLKCR16 Register
#define SYSCTL_CPUSYSLOCK1_LPMCR         0x200000U     // Lock bit for LPMCR Register
#define SYSCTL_CPUSYSLOCK1_GPIOLPMSEL0   0x400000U     // Lock bit for GPIOLPMSEL0 Register
#define SYSCTL_CPUSYSLOCK1_GPIOLPMSEL1   0x800000U     // Lock bit for GPIOLPMSEL1 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR17      0x1000000U    // Lock bit for PCLKCR17 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR18      0x2000000U    // Lock bit for PCLKCR18 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR19      0x4000000U    // Lock bit for PCLKCR19 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR21      0x10000000U   // Lock bit for PCLKCR21 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR22      0x20000000U   // Lock bit for PCLKCR22 Register
#define SYSCTL_CPUSYSLOCK1_PCLKCR23      0x40000000U   // Lock bit for PCLKCR23 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSYSLOCK2 register
//
//*************************************************************************************************
#define SYSCTL_CPUSYSLOCK2_ETHERCATCTL          0x1U          // Lock bit for ETHERCATCTL register
#define SYSCTL_CPUSYSLOCK2_PCLKCR25             0x2U          // Lock bit for PCLKCR25 Register
#define SYSCTL_CPUSYSLOCK2_PCLKCR26             0x4U          // Lock bit for PCLKCR26 Register
#define SYSCTL_CPUSYSLOCK2_PCLKCR27             0x8U          // Lock bit for PCLKCR27 Register
#define SYSCTL_CPUSYSLOCK2_LSEN                 0x10U         // Lock bit for LSEN Register
#define SYSCTL_CPUSYSLOCK2_CMPSSLPMSEL          0x20U         // Lock bit for CMPSSLPMSEL register
#define SYSCTL_CPUSYSLOCK2_PCLKCR28             0x40U         // Lock bit for PCLKCR28 Register
#define SYSCTL_CPUSYSLOCK2_USER_REG1_SYSRSN     0x1000000U    // Lock bit for USER_REG1_SYSRSn
#define SYSCTL_CPUSYSLOCK2_USER_REG2_SYSRSN     0x2000000U    // Lock bit for USER_REG2_SYSRSn
#define SYSCTL_CPUSYSLOCK2_USER_REG1_XRSN       0x4000000U    // Lock bit for USER_REG1_XRSn
#define SYSCTL_CPUSYSLOCK2_USER_REG2_XRSN       0x8000000U    // Lock bit for USER_REG2_XRSn
#define SYSCTL_CPUSYSLOCK2_USER_REG1_PORESETN   0x10000000U   // Lock bit for USER_REG1_PORESETn
#define SYSCTL_CPUSYSLOCK2_USER_REG2_PORESETN   0x20000000U   // Lock bit for USER_REG2_PORESETn
#define SYSCTL_CPUSYSLOCK2_USER_REG3_PORESETN   0x40000000U   // Lock bit for USER_REG3_PORESETn
#define SYSCTL_CPUSYSLOCK2_USER_REG4_PORESETN   0x80000000U   // Lock bit for USER_REG4_PORESETn

//*************************************************************************************************
//
// The following are defines for the bit fields in the PIEVERRADDR register
//
//*************************************************************************************************
#define SYSCTL_PIEVERRADDR_ADDR_S   0U
#define SYSCTL_PIEVERRADDR_ADDR_M   0x3FFFFFU   // PIE Vector Fetch Error Handler Routine Address

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETHERCATCTL register
//
//*************************************************************************************************
#define SYSCTL_ETHERCATCTL_I2CLOOPBACK   0x1U   // Loopback I2C port of etherCAT IP to I2C_A.

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR0 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR0_CLA1         0x1U         // CLA1 Clock Enable Bit
#define SYSCTL_PCLKCR0_DMA          0x4U         // DMA Clock Enable bit
#define SYSCTL_PCLKCR0_CPUTIMER0    0x8U         // CPUTIMER0 Clock Enable bit
#define SYSCTL_PCLKCR0_CPUTIMER1    0x10U        // CPUTIMER1 Clock Enable bit
#define SYSCTL_PCLKCR0_CPUTIMER2    0x20U        // CPUTIMER2 Clock Enable bit
#define SYSCTL_PCLKCR0_CPUBGCRC     0x2000U      // CPUBGCRC Clock Enable Bit
#define SYSCTL_PCLKCR0_CLA1BGCRC    0x4000U      // CLA1BGCRC Clock Enable Bit
#define SYSCTL_PCLKCR0_TBCLKSYNC    0x40000U     // EPWM Time Base Clock sync
#define SYSCTL_PCLKCR0_GTBCLKSYNC   0x80000U     // EPWM Time Base Clock Global sync
#define SYSCTL_PCLKCR0_ERAD         0x1000000U   // ERAD module clock enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR1 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR1_EMIF1   0x1U   // EMIF1 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR2 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR2_EPWM1    0x1U       // EPWM1 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM2    0x2U       // EPWM2 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM3    0x4U       // EPWM3 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM4    0x8U       // EPWM4 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM5    0x10U      // EPWM5 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM6    0x20U      // EPWM6 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM7    0x40U      // EPWM7 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM8    0x80U      // EPWM8 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM9    0x100U     // EPWM9 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM10   0x200U     // EPWM10 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM11   0x400U     // EPWM11 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM12   0x800U     // EPWM12 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM13   0x1000U    // EPWM13 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM14   0x2000U    // EPWM14 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM15   0x4000U    // EPWM15 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM16   0x8000U    // EPWM16 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM17   0x10000U   // EPWM17 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM18   0x20000U   // EPWM18 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR3 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR3_ECAP1   0x1U    // ECAP1 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP2   0x2U    // ECAP2 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP3   0x4U    // ECAP3 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP4   0x8U    // ECAP4 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP5   0x10U   // ECAP5 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP6   0x20U   // ECAP6 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP7   0x40U   // ECAP7 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR4 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR4_EQEP1   0x1U    // EQEP1 Clock Enable bit
#define SYSCTL_PCLKCR4_EQEP2   0x2U    // EQEP2 Clock Enable bit
#define SYSCTL_PCLKCR4_EQEP3   0x4U    // EQEP3 Clock Enable bit
#define SYSCTL_PCLKCR4_EQEP4   0x8U    // EQEP4 Clock Enable bit
#define SYSCTL_PCLKCR4_EQEP5   0x10U   // EQEP5 Clock Enable bit
#define SYSCTL_PCLKCR4_EQEP6   0x20U   // EQEP6 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR6 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR6_SD1   0x1U   // SD1 Clock Enable bit
#define SYSCTL_PCLKCR6_SD2   0x2U   // SD2 Clock Enable bit
#define SYSCTL_PCLKCR6_SD3   0x4U   // SD3 Clock Enable bit
#define SYSCTL_PCLKCR6_SD4   0x8U   // SD4 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR7 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR7_SCI_A    0x1U       // SCI_A Clock Enable bit
#define SYSCTL_PCLKCR7_SCI_B    0x2U       // SCI_B Clock Enable bit
#define SYSCTL_PCLKCR7_UART_A   0x10000U   // UART_A Clock Enable bit
#define SYSCTL_PCLKCR7_UART_B   0x20000U   // UART_B Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR8 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR8_SPI_A   0x1U   // SPI_A Clock Enable bit
#define SYSCTL_PCLKCR8_SPI_B   0x2U   // SPI_B Clock Enable bit
#define SYSCTL_PCLKCR8_SPI_C   0x4U   // SPI_C Clock Enable bit
#define SYSCTL_PCLKCR8_SPI_D   0x8U   // SPI_D Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR9 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR9_I2C_A     0x1U       // I2C_A Clock Enable bit
#define SYSCTL_PCLKCR9_I2C_B     0x2U       // I2C_B Clock Enable bit
#define SYSCTL_PCLKCR9_PMBUS_A   0x10000U   // PMBUS_A Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR10 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR10_CAN_A    0x1U    // CAN_A Clock Enable bit
#define SYSCTL_PCLKCR10_MCAN_A   0x10U   // MCAN_A Clock Enable bit
#define SYSCTL_PCLKCR10_MCAN_B   0x20U   // MCAN_B Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR11 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR11_USB_A   0x10000U   // USB_A Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR13 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR13_ADC_A   0x1U   // ADC_A Clock Enable bit
#define SYSCTL_PCLKCR13_ADC_B   0x2U   // ADC_B Clock Enable bit
#define SYSCTL_PCLKCR13_ADC_C   0x4U   // ADC_C Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR14 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR14_CMPSS1    0x1U     // CMPSS1 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS2    0x2U     // CMPSS2 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS3    0x4U     // CMPSS3 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS4    0x8U     // CMPSS4 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS5    0x10U    // CMPSS5 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS6    0x20U    // CMPSS6 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS7    0x40U    // CMPSS7 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS8    0x80U    // CMPSS8 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS9    0x100U   // CMPSS9 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS10   0x200U   // CMPSS10 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS11   0x400U   // CMPSS11 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR16 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR16_DAC_A   0x10000U   // Buffered_DAC_A Clock Enable Bit
#define SYSCTL_PCLKCR16_DAC_C   0x40000U   // Buffered_DAC_C Clock Enable Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR17 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR17_CLB1   0x1U    // CLB1 Clock Enable bit
#define SYSCTL_PCLKCR17_CLB2   0x2U    // CLB2 Clock Enable bit
#define SYSCTL_PCLKCR17_CLB3   0x4U    // CLB3 Clock Enable bit
#define SYSCTL_PCLKCR17_CLB4   0x8U    // CLB4 Clock Enable bit
#define SYSCTL_PCLKCR17_CLB5   0x10U   // CLB5 Clock Enable bit
#define SYSCTL_PCLKCR17_CLB6   0x20U   // CLB6 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR18 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR18_FSITX_A   0x1U       // FSITX_A Clock Enable bit
#define SYSCTL_PCLKCR18_FSITX_B   0x2U       // FSIRX_A Clock Enable bit
#define SYSCTL_PCLKCR18_FSIRX_A   0x10000U   // FSITX_B Clock Enable bit
#define SYSCTL_PCLKCR18_FSIRX_B   0x20000U   // FSIRX_B Clock Enable bit
#define SYSCTL_PCLKCR18_FSIRX_C   0x40000U   // FSITX_C Clock Enable bit
#define SYSCTL_PCLKCR18_FSIRX_D   0x80000U   // FSIRX_C Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR19 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR19_LIN_A   0x1U   // LIN_A Clock Enable bit
#define SYSCTL_PCLKCR19_LIN_B   0x2U   // LIN_B Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR21 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR21_DCC0   0x1U   // DCC0 Clock Enable Bit
#define SYSCTL_PCLKCR21_DCC1   0x2U   // DCC1 Clock Enable Bit
#define SYSCTL_PCLKCR21_DCC2   0x4U   // DCC2 Clock Enable Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR23 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR23_ETHERCAT   0x1U   // ETHERCAT Clock Enable Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR25 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR25_HRCAL0   0x1U   // HRCAL0 Clock Enable Bit
#define SYSCTL_PCLKCR25_HRCAL1   0x2U   // HRCAL1 Clock Enable Bit
#define SYSCTL_PCLKCR25_HRCAL2   0x4U   // HRCAL2 Clock Enable Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR26 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR26_AESA   0x1U   // AESA Clock Enable Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR27 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR27_EPG1   0x1U   // EPG1 Clock Enable Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR28 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR28_ADCCHECKER1     0x1U       // ADCCHECKER1 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER2     0x2U       // ADCCHECKER2 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER3     0x4U       // ADCCHECKER3 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER4     0x8U       // ADCCHECKER4 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER5     0x10U      // ADCCHECKER5 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER6     0x20U      // ADCCHECKER6 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER7     0x40U      // ADCCHECKER7 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER8     0x80U      // ADCCHECKER8 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCSEAGGRCPU1   0x10000U   // ADCSEAGGRCPU1 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIMRESET register
//
//*************************************************************************************************
#define SYSCTL_SIMRESET_CPU1RSN   0x1U          // Generates a reset to CPU
#define SYSCTL_SIMRESET_XRSN      0x2U          // Generates a simulated XRSn
#define SYSCTL_SIMRESET_KEY_S     16U
#define SYSCTL_SIMRESET_KEY_M     0xFFFF0000U   // Key value to enable write

//*************************************************************************************************
//
// The following are defines for the bit fields in the LPMCR register
//
//*************************************************************************************************
#define SYSCTL_LPMCR_LPM_S         0U
#define SYSCTL_LPMCR_LPM_M         0x3U      // Low Power Mode setting
#define SYSCTL_LPMCR_QUALSTDBY_S   2U
#define SYSCTL_LPMCR_QUALSTDBY_M   0xFCU     // STANDBY Wakeup Pin Qualification Setting
#define SYSCTL_LPMCR_WDINTE        0x8000U   // Enable for WDINT wakeup from STANDBY

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUID register
//
//*************************************************************************************************
#define SYSCTL_CPUID_CPUID_S   0U
#define SYSCTL_CPUID_CPUID_M   0x3U   // Indicates CPU1 or CPU2

