TexasInstruments/c2000ware-core-sdk/driverlib/f28p65x/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the HRPWM0_AC register
//
//*************************************************************************************************
#define SYSCTL_HRPWM0_AC_CPU1_ACC_S   0U
#define SYSCTL_HRPWM0_AC_CPU1_ACC_M   0x3U    // CPU1 Access conditions to peripheral
#define SYSCTL_HRPWM0_AC_CLA1_ACC_S   2U
#define SYSCTL_HRPWM0_AC_CLA1_ACC_M   0xCU    // CLA1 Access Conditions to Peripheral
#define SYSCTL_HRPWM0_AC_DMA1_ACC_S   4U
#define SYSCTL_HRPWM0_AC_DMA1_ACC_M   0x30U   // DMA1 Access Conditions to Peripheral

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRPWM1_AC register
//
//*************************************************************************************************
#define SYSCTL_HRPWM1_AC_CPU1_ACC_S   0U
#define SYSCTL_HRPWM1_AC_CPU1_ACC_M   0x3U    // CPU1 Access conditions to peripheral
#define SYSCTL_HRPWM1_AC_CLA1_ACC_S   2U
#define SYSCTL_HRPWM1_AC_CLA1_ACC_M   0xCU    // CLA1 Access Conditions to Peripheral
#define SYSCTL_HRPWM1_AC_DMA1_ACC_S   4U
#define SYSCTL_HRPWM1_AC_DMA1_ACC_M   0x30U   // DMA1 Access Conditions to Peripheral

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRPWM2_AC register
//
//*************************************************************************************************
#define SYSCTL_HRPWM2_AC_CPU1_ACC_S   0U
#define SYSCTL_HRPWM2_AC_CPU1_ACC_M   0x3U    // CPU1 Access conditions to peripheral
#define SYSCTL_HRPWM2_AC_CLA1_ACC_S   2U
#define SYSCTL_HRPWM2_AC_CLA1_ACC_M   0xCU    // CLA1 Access Conditions to Peripheral
#define SYSCTL_HRPWM2_AC_DMA1_ACC_S   4U
#define SYSCTL_HRPWM2_AC_DMA1_ACC_M   0x30U   // DMA1 Access Conditions to Peripheral

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETHERCAT_AC register
//
//*************************************************************************************************
#define SYSCTL_ETHERCAT_AC_CPU1_ACC_S   0U
#define SYSCTL_ETHERCAT_AC_CPU1_ACC_M   0x3U    // CPU1 Access conditions to peripheral
#define SYSCTL_ETHERCAT_AC_DMA1_ACC_S   4U
#define SYSCTL_ETHERCAT_AC_DMA1_ACC_M   0x30U   // DMA1 Access Conditions to Peripheral

//*************************************************************************************************
//
// The following are defines for the bit fields in the AESA_AC register
//
//*************************************************************************************************
#define SYSCTL_AESA_AC_CPUX_ACC_S   0U
#define SYSCTL_AESA_AC_CPUX_ACC_M   0x3U    // CPUx Access conditions to peripheral
#define SYSCTL_AESA_AC_DMA1_ACC_S   4U
#define SYSCTL_AESA_AC_DMA1_ACC_M   0x30U   // DMA1 Access Conditions to Peripheral

//*************************************************************************************************
//
// The following are defines for the bit fields in the UARTA_AC register
//
//*************************************************************************************************
#define SYSCTL_UARTA_AC_CPUX_ACC_S   0U
#define SYSCTL_UARTA_AC_CPUX_ACC_M   0x3U    // CPUx Access conditions to peripheral
#define SYSCTL_UARTA_AC_DMA1_ACC_S   4U
#define SYSCTL_UARTA_AC_DMA1_ACC_M   0x30U   // DMA1 Access Conditions to Peripheral

//*************************************************************************************************
//
// The following are defines for the bit fields in the UARTB_AC register
//
//*************************************************************************************************
#define SYSCTL_UARTB_AC_CPUX_ACC_S   0U
#define SYSCTL_UARTB_AC_CPUX_ACC_M   0x3U    // CPUx Access conditions to peripheral
#define SYSCTL_UARTB_AC_DMA1_ACC_S   4U
#define SYSCTL_UARTB_AC_DMA1_ACC_M   0x30U   // DMA1 Access Conditions to Peripheral

//*************************************************************************************************
//
// The following are defines for the bit fields in the PERIPH_AC_LOCK register
//
//*************************************************************************************************
#define SYSCTL_PERIPH_AC_LOCK_LOCK_AC_WR   0x1U   // Lock control for Access control registers
                                                  // write.


//*************************************************************************************************
//
// The following are defines for the bit fields in the SYNCSELECT register
//
//*************************************************************************************************
#define SYSCTL_SYNCSELECT_SYNCOUT_S   24U
#define SYSCTL_SYNCSELECT_SYNCOUT_M   0x1F000000U   // Select Syncout Source

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOUTSELECT register
//
//*************************************************************************************************
#define SYSCTL_ADCSOCOUTSELECT_PWM1SOCAEN    0x1U          // PWM1SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM2SOCAEN    0x2U          // PWM2SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM3SOCAEN    0x4U          // PWM3SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM4SOCAEN    0x8U          // PWM4SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM5SOCAEN    0x10U         // PWM5SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM6SOCAEN    0x20U         // PWM6SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM7SOCAEN    0x40U         // PWM7SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM8SOCAEN    0x80U         // PWM8SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM9SOCAEN    0x100U        // PWM9SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM10SOCAEN   0x200U        // PWM10SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM11SOCAEN   0x400U        // PWM11SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM12SOCAEN   0x800U        // PWM12SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM13SOCAEN   0x1000U       // PWM13SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM14SOCAEN   0x2000U       // PWM14SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM15SOCAEN   0x4000U       // PWM15SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM16SOCAEN   0x8000U       // PWM16SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM1SOCBEN    0x10000U      // PWM1SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM2SOCBEN    0x20000U      // PWM2SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM3SOCBEN    0x40000U      // PWM3SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM4SOCBEN    0x80000U      // PWM4SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM5SOCBEN    0x100000U     // PWM5SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM6SOCBEN    0x200000U     // PWM6SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM7SOCBEN    0x400000U     // PWM7SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM8SOCBEN    0x800000U     // PWM8SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM9SOCBEN    0x1000000U    // PWM9SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM10SOBAEN   0x2000000U    // PWM10SOBAEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM11SOBAEN   0x4000000U    // PWM11SOBAEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM12SOBAEN   0x8000000U    // PWM12SOBAEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM13SOCBEN   0x10000000U   // PWM13SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM14SOBAEN   0x20000000U   // PWM14SOBAEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM15SOBAEN   0x40000000U   // PWM15SOBAEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM16SOBAEN   0x80000000U   // PWM16SOBAEN Enable for ADCSOCBOn

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOUTSELECT1 register
//
//*************************************************************************************************
#define SYSCTL_ADCSOCOUTSELECT1_PWM17SOCAEN   0x1U       // PWM17SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT1_PWM18SOCAEN   0x2U       // PWM18SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT1_PWM17SOCBEN   0x10000U   // PWM17SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT1_PWM18SOCBEN   0x20000U   // PWM18SOCBEN Enable for ADCSOCBOn

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYNCSOCLOCK register
//
//*************************************************************************************************
#define SYSCTL_SYNCSOCLOCK_SYNCSELECT         0x1U   // SYNCSEL Register Lock bit
#define SYSCTL_SYNCSOCLOCK_ADCSOCOUTSELECT    0x2U   // ADCSOCOUTSELECT Register Lock bit
#define SYSCTL_SYNCSOCLOCK_ADCSOCOUTSELECT1   0x4U   // ADCSOCOUTSELECT1 Register Lock bit


//*************************************************************************************************
//
// The following are defines for the bit fields in the LFUConfig register
//
//*************************************************************************************************
#define SYSCTL_LFUCONFIG_LFU_CPU         0x1U        // SW configuration to implement LFU
#define SYSCTL_LFUCONFIG_LFU_CLA1        0x10U       // SW configuration to implement LFU
#define SYSCTL_LFUCONFIG_PIEVECTORSWAP   0x1000U     // Swap of pie vector table
#define SYSCTL_LFUCONFIG_LS01SWAP        0x100000U   // Swap LS0 and LS1 memory

//*************************************************************************************************
//
// The following are defines for the bit fields in the LFUStatus_CPU1 register
//
//*************************************************************************************************
#define SYSCTL_LFUSTATUS_PIEVECTORSWAP   0x1000U     // Indicate the status of PieVectorSwap
#define SYSCTL_LFUSTATUS_LS01SWAP        0x100000U   // Indicate the status of LS0/LS1 memory
                                                     // swap

//*************************************************************************************************
//
// The following are defines for the bit fields in the LFU_LOCK register
//
//*************************************************************************************************
#define SYSCTL_LFU_LOCK_LFUCONFIG            0x1U      // Register lock configuration
#define SYSCTL_LFU_LOCK_SWCONFIG1_SYSRSN     0x100U    // Register lock configuration
#define SYSCTL_LFU_LOCK_SWCONFIG2_SYSRSN     0x200U    // Register lock configuration
#define SYSCTL_LFU_LOCK_SWCONFIG1_XRSN       0x400U    // Register lock configuration
#define SYSCTL_LFU_LOCK_SWCONFIG2_XRSN       0x800U    // Register lock configuration
#define SYSCTL_LFU_LOCK_SWCONFIG1_PORESETN   0x1000U   // Register lock configuration
#define SYSCTL_LFU_LOCK_SWCONFIG2_PORESETN   0x2000U   // Register lock configuration

//*************************************************************************************************
//
// The following are defines for the bit fields in the LFU_COMMIT register
//
//*************************************************************************************************
#define SYSCTL_LFU_COMMIT_LFUCONFIG            0x1U      // Register commit configuration
#define SYSCTL_LFU_COMMIT_SWCONFIG1_SYSRSN     0x100U    // Register commit configuration
#define SYSCTL_LFU_COMMIT_SWCONFIG2_SYSRSN     0x200U    // Register commit configuration
#define SYSCTL_LFU_COMMIT_SWCONFIG1_XRSN       0x400U    // Register commit configuration
#define SYSCTL_LFU_COMMIT_SWCONFIG2_XRSN       0x800U    // Register commit configuration
#define SYSCTL_LFU_COMMIT_SWCONFIG1_PORESETN   0x1000U   // Register commit configuration
#define SYSCTL_LFU_COMMIT_SWCONFIG2_PORESETN   0x2000U   // Register commit configuration

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_INT_FLG register
//
//*************************************************************************************************
#define SYSCTL_SYS_ERR_INT_FLG_GINT              0x1U     // Global Interrupt flag
#define SYSCTL_SYS_ERR_INT_FLG_EMIF_ERR          0x2U     // EMIF error event flag
#define SYSCTL_SYS_ERR_INT_FLG_CORRECTABLE_ERR   0x4U     // RAM/Flash correctable error flag
#define SYSCTL_SYS_ERR_INT_FLG_RAM_ACC_VIOL      0x10U    // A RAM access vioation flag.
#define SYSCTL_SYS_ERR_INT_FLG_SYS_PLL_SLIP      0x20U    // System PLL Slip event flag.
#define SYSCTL_SYS_ERR_INT_FLG_AUX_PLL_SLIP      0x40U    // Auxillary PLL Slip event flag.
#define SYSCTL_SYS_ERR_INT_FLG_DCC0              0x80U    // DCC0 Interrupt flag.
#define SYSCTL_SYS_ERR_INT_FLG_DCC1              0x100U   // DCC1 Interrupt flag.
#define SYSCTL_SYS_ERR_INT_FLG_DCC2              0x200U   // DCC2 Interrupt flag.
#define SYSCTL_SYS_ERR_INT_FLG_AES_BUS_ERROR     0x400U   // AES_BUS_ERROR Interrupt flag.
#define SYSCTL_SYS_ERR_INT_FLG_EPG1_INT          0x800U   // EPG1_INT Interrupt flag.

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_INT_CLR register
//
//*************************************************************************************************
#define SYSCTL_SYS_ERR_INT_CLR_GINT              0x1U     // Global Interrupt flag Clear bit
#define SYSCTL_SYS_ERR_INT_CLR_EMIF_ERR          0x2U     // EMIF_ERR interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_CORRECTABLE_ERR   0x4U     // CORRECTABLE_ERR interrupt flag clear
                                                          // bit
#define SYSCTL_SYS_ERR_INT_CLR_RAM_ACC_VIOL      0x10U    // RAM_ACC_VIOL interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_SYS_PLL_SLIP      0x20U    // SYS_PLL_SLIP interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_AUX_PLL_SLIP      0x40U    // AUX_PLL_SLIP interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_DCC0              0x80U    // DCC0 interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_DCC1              0x100U   // DCC1 interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_DCC2              0x200U   // DCC2 interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_AES_BUS_ERROR     0x400U   // AES_BUS_ERROR interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_EPG1_INT          0x800U   // EPG1_INT interrupt flag clear bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_INT_SET register
//
//*************************************************************************************************
#define SYSCTL_SYS_ERR_INT_SET_EMIF_ERR          0x2U          // EMIF_ERR interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_CORRECTABLE_ERR   0x4U          // CORRECTABLE_ERR interrupt flag
                                                               // set bit
#define SYSCTL_SYS_ERR_INT_SET_RAM_ACC_VIOL      0x10U         // RAM_ACC_VIOL interrupt flag set
                                                               // bit
#define SYSCTL_SYS_ERR_INT_SET_SYS_PLL_SLIP      0x20U         // SYS_PLL_SLIP interrupt flag set
                                                               // bit
#define SYSCTL_SYS_ERR_INT_SET_AUX_PLL_SLIP      0x40U         // AUX_PLL_SLIP interrupt flag set
                                                               // bit
#define SYSCTL_SYS_ERR_INT_SET_DCC0              0x80U         // DCC0 interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_DCC1              0x100U        // DCC1 interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_DCC2              0x200U        // DCC2 interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_AES_BUS_ERROR     0x400U        // AES_BUS_ERROR interrupt flag set
                                                               // bit
#define SYSCTL_SYS_ERR_INT_SET_EPG1_INT          0x800U        // EPG1_INT interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_KEY_S             24U
#define SYSCTL_SYS_ERR_INT_SET_KEY_M             0xFF000000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_MASK register
//
//*************************************************************************************************
#define SYSCTL_SYS_ERR_MASK_EMIF_ERR          0x2U          // EMIF_ERR flag mask bit
#define SYSCTL_SYS_ERR_MASK_CORRECTABLE_ERR   0x4U          // CORRECTABLE_ERR flag mask bit
#define SYSCTL_SYS_ERR_MASK_RAM_ACC_VIOL      0x10U         // RAM_ACC_VIOL flag mask bit
#define SYSCTL_SYS_ERR_MASK_SYS_PLL_SLIP      0x20U         // SYS_PLL_SLIP flag mask bit
#define SYSCTL_SYS_ERR_MASK_AUX_PLL_SLIP      0x40U         // AUX_PLL_SLIP flag mask bit
#define SYSCTL_SYS_ERR_MASK_DCC0              0x80U         // DCC0 flag mask bit
#define SYSCTL_SYS_ERR_MASK_DCC1              0x100U        // DCC1 flag mask bit
#define SYSCTL_SYS_ERR_MASK_DCC2              0x200U        // DCC2 flag mask bit
#define SYSCTL_SYS_ERR_MASK_AES_BUS_ERROR     0x400U        // AES_BUS_ERROR flag mask bit
#define SYSCTL_SYS_ERR_MASK_EPG1_INT          0x800U        // EPG1_INT flag mask bit
#define SYSCTL_SYS_ERR_MASK_KEY_S             24U
#define SYSCTL_SYS_ERR_MASK_KEY_M             0xFF000000U   // KEY field




//*************************************************************************************************
//
// The following are defines for the bit fields in the LCM_ERR_FLG register
//
//*************************************************************************************************
#define SYSCTL_LCM_ERR_FLG_GERR   0x1U   // Global Error event flag
#define SYSCTL_LCM_ERR_FLG_CPU    0x2U   // CPU Lokstep Miscompare flag
#define SYSCTL_LCM_ERR_FLG_DMA    0x4U   // DMA Lokstep Miscompare flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the LCM_ERR_FLG_CLR register
//
//*************************************************************************************************
#define SYSCTL_LCM_ERR_FLG_CLR_GERR   0x1U   // Global Error event flag
#define SYSCTL_LCM_ERR_FLG_CLR_CPU    0x2U   // CPU Lokstep Miscompare flag
#define SYSCTL_LCM_ERR_FLG_CLR_DMA    0x4U   // DMA Lokstep Miscompare flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the LCM_ERR_FLG_SET register
//
//*************************************************************************************************
#define SYSCTL_LCM_ERR_FLG_SET_CPU     0x2U          // CPU Lokstep Miscompare flag set
#define SYSCTL_LCM_ERR_FLG_SET_DMA     0x4U          // DMA Lokstep Miscompare flag set
#define SYSCTL_LCM_ERR_FLG_SET_KEY_S   24U
#define SYSCTL_LCM_ERR_FLG_SET_KEY_M   0xFF000000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the LCM_ERR_FLG_MASK register
//
//*************************************************************************************************
#define SYSCTL_LCM_ERR_FLG_MASK_CPU     0x2U          // CPU Lokstep Miscompare flag mask
#define SYSCTL_LCM_ERR_FLG_MASK_DMA     0x4U          // DMA Lokstep Miscompare flag mask
#define SYSCTL_LCM_ERR_FLG_MASK_KEY_S   24U
#define SYSCTL_LCM_ERR_FLG_MASK_KEY_M   0xFF000000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the REGPARITY_ERR_FLG register
//
//*************************************************************************************************
#define SYSCTL_REGPARITY_ERR_FLG_GERR   0x1U   // Global Error event flag
#define SYSCTL_REGPARITY_ERR_FLG_CPU    0x2U   // Register parity error from lockstep compare
                                               // module
#define SYSCTL_REGPARITY_ERR_FLG_DMA    0x4U   // Register parity error from lockstep compare
                                               // module

//*************************************************************************************************
//
// The following are defines for the bit fields in the REGPARITY_ERR_FLG_CLR register
//
//*************************************************************************************************
#define SYSCTL_REGPARITY_ERR_FLG_CLR_GERR   0x1U   // Global Error event flag clear
#define SYSCTL_REGPARITY_ERR_FLG_CLR_CPU    0x2U   // Register parity error from lockstep compare
                                                   // module clear
#define SYSCTL_REGPARITY_ERR_FLG_CLR_DMA    0x4U   // Register parity error from lockstep compare
                                                   // module clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the REGPARITY_ERR_FLG_SET register
//
//*************************************************************************************************
#define SYSCTL_REGPARITY_ERR_FLG_SET_CPU     0x2U          // Register parity error from lockstep
                                                           // compare module set
#define SYSCTL_REGPARITY_ERR_FLG_SET_DMA     0x4U          // Register parity error from lockstep
                                                           // compare module set
#define SYSCTL_REGPARITY_ERR_FLG_SET_KEY_S   24U
#define SYSCTL_REGPARITY_ERR_FLG_SET_KEY_M   0xFF000000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the REGPARITY_ERR_FLG_MASK register
//
//*************************************************************************************************
#define SYSCTL_REGPARITY_ERR_FLG_MASK_CPU     0x2U          // Register parity error from lockstep
                                                            // compare module mask
#define SYSCTL_REGPARITY_ERR_FLG_MASK_DMA     0x4U          // Register parity error from lockstep
                                                            // compare module mask
#define SYSCTL_REGPARITY_ERR_FLG_MASK_KEY_S   24U
#define SYSCTL_REGPARITY_ERR_FLG_MASK_KEY_M   0xFF000000U   // KEY field



#endif
